//Написать программу Text editor 
//Программа позволяет пользователю, взаимодействуя с консолью записывать в файл.
//Программа завершается, если наберу слово “exit”
//По завершению программы, вывести статистику файла:
//Содержимое файла в консоль.
//Общее количество символов
//Номер строки с самым большим количеством гласных
//количество слов (регулярное выражение для всех пробелов)
//В программе использовать:
//Files.write()
//StandardOpenOption
//Files.lines



package HW8;

public class TextEditor {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
